In [2]:
import pandas as pd
df=pd.read_csv("transactions.csv")
print(df.head(2))

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1

In [3]:
print(df.tail(10))

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [4]:
print(df.tail(100))

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   UserID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   Quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes
None

In [8]:
df.rename(columns={"Quantity":"quantity"},inplace=True)
print(df)

   TransactionID TransactionDate  UserID  ProductID  quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [11]:
df.rename(columns={"UserID":"userID"},inplace=True)
print(df)

   TransactionID TransactionDate  userID  ProductID  quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [21]:
from datetime import datetime
#now=pd.to_datetime(str(datetime()),format='%Y-%m-%d',str(time.now()),format="%H:%m:%s")
now = pd.to_datetime(datetime.now().strftime('%Y-%m-%d %H:%M:%S'))

print("Today's date:")
print(now)

Today's date:
2025-01-28 15:21:21

In [22]:
tenth_row=df.iloc[9].values
print("Tenth row from the file")
print(tenth_row)

Tenth row from the file
[10 '2016-05-08' 3.0 4 4]

In [23]:
subset_rows=df.iloc[[0,2,5]]
print(subset_rows)

   TransactionID TransactionDate  userID  ProductID  quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
5              6      2013-12-23     2.0          5         6

In [34]:
filter = [True,False,True,False,False,True,False,True,False,False]
subset_rows=df[filter]
print(subset_rows)

   TransactionID TransactionDate  userID  ProductID  quantity
0              1      2010-08-21     7.0          2         1
2              3      2011-06-16     3.0          3         1
5              6      2013-12-23     2.0          5         6
7              8      2014-04-24     NaN          2         3

In [ ]:
#Print Summary of transaction data set

In [26]:
print(df.describe())

       TransactionID    userID  ProductID   quantity
count       10.00000  9.000000  10.000000  10.000000
mean         5.50000  3.444444   3.400000   2.400000
std          3.02765  2.127858   1.074968   1.712698
min          1.00000  1.000000   2.000000   1.000000
25%          3.25000  2.000000   2.250000   1.000000
50%          5.50000  3.000000   4.000000   2.000000
75%          7.75000  3.000000   4.000000   3.000000
max         10.00000  7.000000   5.000000   6.000000

In [27]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   userID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes
None

In [28]:
print("Number of Attributes are",len(df.columns))

Number of Attributes are 5

In [32]:
print("Number of Record are",len(df))

Number of Record are 10

In [ ]:
#Get the column names

In [36]:
row_names = df.columns
print(row_names)

Index(['TransactionID', 'TransactionDate', 'userID', 'ProductID', 'quantity'], dtype='object')

In [ ]:
#Order the rows of transactions by TransactionId
#descending, if ascending then ascending=True

In [42]:
df_Arranged=df.sort_values(by=["TransactionID"],ascending=[True])
print(df_Arranged)

   TransactionID TransactionDate  userID  ProductID  quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
5              6      2013-12-23     2.0          5         6
6              7      2013-12-30     3.0          4         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [44]:
df_Arranged=df.sort_values(by=["TransactionID"],ascending=[False])
print(df_Arranged)

   TransactionID TransactionDate  userID  ProductID  quantity
9             10      2016-05-08     3.0          4         4
8              9      2015-04-24     7.0          4         3
7              8      2014-04-24     NaN          2         3
6              7      2013-12-30     3.0          4         1
5              6      2013-12-23     2.0          5         6
4              5      2013-06-06     2.0          4         1
3              4      2012-08-26     1.0          2         3
2              3      2011-06-16     3.0          3         1
1              2      2011-05-26     3.0          4         1
0              1      2010-08-21     7.0          2         1

In [45]:
df_Arranged=df.sort_values(by=["quantity","TransactionID"],ascending=[True,False])
print(df_Arranged)

   TransactionID TransactionDate  userID  ProductID  quantity
6              7      2013-12-30     3.0          4         1
4              5      2013-06-06     2.0          4         1
2              3      2011-06-16     3.0          3         1
1              2      2011-05-26     3.0          4         1
0              1      2010-08-21     7.0          2         1
8              9      2015-04-24     7.0          4         3
7              8      2014-04-24     NaN          2         3
3              4      2012-08-26     1.0          2         3
9             10      2016-05-08     3.0          4         4
5              6      2013-12-23     2.0          5         6

In [ ]:
#Set the column order of Transactions as ProductID,Quantity, TransactionDate, TransactionID, UserID

In [47]:
df=df[["ProductID","quantity","TransactionDate","TransactionID","userID"]]
print(df)

   ProductID  quantity TransactionDate  TransactionID  userID
0          2         1      2010-08-21              1     7.0
1          4         1      2011-05-26              2     3.0
2          3         1      2011-06-16              3     3.0
3          2         3      2012-08-26              4     1.0
4          4         1      2013-06-06              5     2.0
5          5         6      2013-12-23              6     2.0
6          4         1      2013-12-30              7     3.0
7          2         3      2014-04-24              8     NaN
8          4         3      2015-04-24              9     7.0
9          4         4      2016-05-08             10     3.0

In [ ]:
#Make UserID the first column of transactions

In [48]:
df=df[["userID","ProductID","quantity","TransactionDate","TransactionID"]]
print(df)

   userID  ProductID  quantity TransactionDate  TransactionID
0     7.0          2         1      2010-08-21              1
1     3.0          4         1      2011-05-26              2
2     3.0          3         1      2011-06-16              3
3     1.0          2         3      2012-08-26              4
4     2.0          4         1      2013-06-06              5
5     2.0          5         6      2013-12-23              6
6     3.0          4         1      2013-12-30              7
7     NaN          2         3      2014-04-24              8
8     7.0          4         3      2015-04-24              9
9     3.0          4         4      2016-05-08             10

In [ ]:
#Extracting arrays from a Data Frame. Get the 2nd column

In [52]:
second_column=df.iloc[:,1].to_numpy()
print(second_column)

[2 4 3 2 4 5 4 2 4 4]

In [54]:
ProductID=df["ProductID"].to_numpy()
print(ProductID)

[2 4 3 2 4 5 4 2 4 4]

In [ ]:
#Row subsetting, subset rows 1,3 and 6

In [55]:
Subset_rows=df.iloc[[0,2,5]]
print(Subset_rows)

   userID  ProductID  quantity TransactionDate  TransactionID
0     7.0          2         1      2010-08-21              1
2     3.0          3         1      2011-06-16              3
5     2.0          5         6      2013-12-23              6

In [ ]:
#subset rows excluding 1,3 and 6

In [66]:
excludeRows=[0,2,5]
subSet=df.loc[[i for i in df.index if i not in excludeRows]]
print(subSet)

   userID  ProductID  quantity TransactionDate  TransactionID
1     3.0          4         1      2011-05-26              2
3     1.0          2         3      2012-08-26              4
4     2.0          4         1      2013-06-06              5
6     3.0          4         1      2013-12-30              7
7     NaN          2         3      2014-04-24              8
8     7.0          4         3      2015-04-24              9
9     3.0          4         4      2016-05-08             10

In [67]:
subSetAnotherWay=df.drop([0,2,5])
subSetAnotherWay

   userID  ProductID  quantity TransactionDate  TransactionID
1     3.0          4         1      2011-05-26              2
3     1.0          2         3      2012-08-26              4
4     2.0          4         1      2013-06-06              5
6     3.0          4         1      2013-12-30              7
7     NaN          2         3      2014-04-24              8
8     7.0          4         3      2015-04-24              9
9     3.0          4         4      2016-05-08             10

In [68]:
df.head(3)

   userID  ProductID  quantity TransactionDate  TransactionID
0     7.0          2         1      2010-08-21              1
1     3.0          4         1      2011-05-26              2
2     3.0          3         1      2011-06-16              3

In [69]:
df.tail(2)

   userID  ProductID  quantity TransactionDate  TransactionID
8     7.0          4         3      2015-04-24              9
9     3.0          4         4      2016-05-08             10

In [74]:
subSetAnotherWay=df.drop(index=df.index[-2:])
subSetAnotherWay

   userID  ProductID  quantity TransactionDate  TransactionID
0     7.0          2         1      2010-08-21              1
1     3.0          4         1      2011-05-26              2
2     3.0          3         1      2011-06-16              3
3     1.0          2         3      2012-08-26              4
4     2.0          4         1      2013-06-06              5
5     2.0          5         6      2013-12-23              6
6     3.0          4         1      2013-12-30              7
7     NaN          2         3      2014-04-24              8

In [ ]:
#Subset rows excluding the first 3 rows

In [75]:
subSetAnotherWay=df.drop(index=df.index[1:])
subSetAnotherWay

   userID  ProductID  quantity TransactionDate  TransactionID
0     7.0          2         1      2010-08-21              1